// Масиви та об'єкти:
// - Створити масив, наповнити його 10 елементами будь-якого типу, вивести кожен елемент в консоль
// - Створити 3 об'єкти які описують книги. Поля об'єкту : title ,pageCount, genre.
// - Створити 3 об'єкти які описують книги. Поля об'єкту : title ,pageCount, genre, authors. Поле "автори" - являється
// масивом. Кожен автор має поля name та age.
// - Створити масив з 10 об'єктами які описують сутніть "користувач". Поля: name, username,password. Вивести в консоль
// пароль кожного користувача
//
//
// Логічні розгалуження:
//     - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що
//     дорівнює 1, 0, -3
// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години
// попадає число
// (в першу, другу, третю или четверту частину години).
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це
// число (у першу, другу чи третю).
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані
// відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.
//
//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється
//         falsy (хибноподібні, тобто приводиться до false)
//
//
//     - з файлу arrays.js (лежить в папці 2023 plan ) взяти масив coursesAndDurationArray. За допомоги іф перевірити
//     кожен його елемент на тривалість навчання. У випадку якщо тривалість довша за 5 місяців вивести в консоль "Супер".

// let x = undefined;
// x = x || 'default';
// console.log(x);

// let name = 'Maria';
//
// let obj = {
//     age:22
// }
//
// obj.name = name;
// console.log(obj);

// let str = 1;
//
// switch (str) {
//     case 'Hello':
//         console.log('Hello world');
//         break;
//     case 1:
//         console.log('Error');
//         break;
//     default:
//         console.log('????????????');
// }

// let str = 'a' < 'A';
// console.log(str);

// let day = -3;
// if (day > 0 && day < 10) {
//     console.log('+');
// } else {
//     console.log('-');
// }

// let obj = {
//     name: 'Vasya',
//     age: 22,
//     status: true,
//     skills: ['js','java'],
//     authors: [
//         {name: 'Roma'},
//         {name:'Petya'}
//     ]
// }
// console.log(obj.name,obj.age);

// let students = {
//     st1:{name: 'Anna', age: 20},
//     st2:{name: 'Olga', age: 25},
//     st3:[{}],
// }
// students.st3[0].tree = 'Vasya';
// console.log(students);


            // 0  1  2  3  4
// let arr = [{},1, 2, 3, 4];
// console.log(arr.length);
// console.log(arr[2]);
// arr[arr.length - 1] = 5;
// console.log(arr[arr.length - 2]);
//
// delete arr[0];
// console.log(arr);
//
// arr[0] = {};
// console.log(arr);




























